/*
Какие недостатки вы видите в стиле написания кода этого примера?
*/

function pow(x,n)  // без пробела между аргументами
{  // фигурная скобка на новой строке
  let result=1;   // нет пробелов вокруг знака =
  for(let i=0;i<n;i++) {result*=x;}   // нет пробелов
  // содержимое скобок { } лучше вынести на отдельную строку
  return result;
}

let x=prompt("x?",''), n=prompt("n?",'') // нет пробелов, и лучше написать в 2 строки
if (n<=0)  // нет пробелов, лучше добавить отступ в одну строку сверху
{   // фигурная скобка на новой строке
  alert(`Степень ${n} не поддерживается, введите целую степень, большую 0`);
}
else // лучше на одной строке со скобками: "} else {"
{
  alert(pow(x,n)) /* вложенный вызов функции без пробелов, 
  	нет пробела между аргументами и точки с запятой в конце */
}